Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/SettingsStorages/ХранилищеВариантовИНастроекОтчетов/Forms/ФормаСохранения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Ключ		 = Параметры.КлючОбъекта;
	ЭтаФорма.Организация = ?(ЗначениеЗаполнено(Параметры.Организация), Параметры.Организация, ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация"));
	ЭтаФорма.Автор		 = РаботаСПользователями.ТекущийПользователь();
	
	ОбновитьСписок();
	
	ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(Параметры.КлючТекущихНастроек);
	
	НайденныеСтрокии = ЭтаФорма.Список.НайтиСтроки(Новый Структура("Ссылка", ВариантОтчета));
	
	Если НайденныеСтрокии.Количество() = 1 Тогда
		Элементы.Список.ТекущаяСтрока = НайденныеСтрокии[0].ПолучитьИдентификатор();
	КонецЕсли;
	
	ЭтаФорма.ПолныеПрава = РольДоступна("ПолныеПрава");
	
	Если НРег(Лев(ЭтаФорма.Ключ, 9)) = "обработка" Или НРег(Лев(ЭтаФорма.Ключ, 16)) = "внешняяобработка" Тогда
		ЭтаФорма.Заголовок = "Сохранение настроек";
	ИначеЕсли СтрНайти(ЭтаФорма.Ключ, "/") = 0 Тогда
		ЭтаФорма.Заголовок = "Сохранение варианта отчета";
	Иначе
		ЭтаФорма.Заголовок = "Сохранение настройки отчета";
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
	
		ЭтаФорма.Общий = ?(ТекСтрока.Общий, 1, 0);
		Если ТекСтрока.Картинка = 5 Или Не ТекСтрока.Автор = ЭтаФорма.Автор Тогда
			ЭтаФорма.Наименование = СформироватьСвободноеНаименование(ТекСтрока.Наименование);
			ЭтаФорма.Общий = 0;
		Иначе
			ЭтаФорма.Наименование = ТекСтрока.Наименование;
		КонецЕсли; 			
	
	КонецЕсли; 

КонецПроцедуры
 
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		Если ЭтаФорма.ПолныеПрава Или ЭтаФорма.Автор = ТекСтрока.Автор Тогда
			
			Параметрыформы = Новый Структура("Ключ", ТекСтрока.Ссылка);
			ОткрытьФормуМодально("Справочник.ВариантыОтчетов.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
			Обновить(Неопределено);
			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если Не ТекСтрока = Неопределено Тогда
		Если (ЭтаФорма.ПолныеПрава Или ЭтаФорма.Автор = ТекСтрока.Автор) Тогда
			
			Если ТекСтрока.Картинка = 3 Тогда
			
				ТекстВопроса = "Снять с """ + ТекСтрока.Ссылка + """ пометку на удаление?";
				
			Иначе
				
				ТекстВопроса = "Пометить """ + ТекСтрока.Ссылка + """ на удаление?";
			
			КонецЕсли; 
			
			Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
				УстановитьПометкуУдаления(ТекСтрока.Ссылка);
				Обновить(Неопределено);
				
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли;
		
КонецПроцедуры


#КонецОбласти 

#Область КомандыФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	НайденныеСтроки = ЭтаФорма.Список.НайтиСтроки(Новый Структура("Наименование, Автор", ЭтаФорма.Наименование, ЭтаФорма.Автор));
	СтруктураВарианта = Новый Структура;
	Отказ = Ложь;
	
	Если НайденныеСтроки.Количество() > 0 Тогда
	
		Элементы.Список.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		Если Вопрос("Заменить ранее сохраненный вариант отчета """ + Наименование + """", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			СтруктураВарианта.Вставить("Ссылка", НайденныеСтроки[0].Ссылка);
		Иначе
			Отказ = Истина;
		КонецЕсли; 
	
	КонецЕсли; 
	
	Если Не Отказ Тогда
	
		СтруктураВарианта.Вставить("Ключ", 			ЭтаФорма.Ключ);
		СтруктураВарианта.Вставить("Наименование", 	ЭтаФорма.Наименование);
		СтруктураВарианта.Вставить("Организация", 	ЭтаФорма.Организация);
		СтруктураВарианта.Вставить("Автор", 		ЭтаФорма.Автор);
		СтруктураВарианта.Вставить("Общий", 		ЭтаФорма.Общий = 1);
		СтруктураВарианта.Вставить("ПредопределенныйВариант", Ложь);
		СтруктураВарианта.Вставить("ИмяПредопределенногоВарианта", "");
		
		УИД = СоздатьНастройку(СтруктураВарианта);
		Закрыть(Новый ВыборНастроек(УИД));		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	КлючТекущейСтрокиСписок = РаботаСФормамиКлиент.ПолучитьКлючТекущейСтроки(Элементы.Список, "Ссылка");
	ОбновитьСписок();
	РаботаСФормамиКлиент.ВосстановитьТекущуюСтрокуПоКлючу(ЭтаФорма.Список, Элементы.Список, "Ссылка", КлючТекущейСтрокиСписок);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьНастройку(СтруктураВарианта)

	Ссылка = Неопределено;
	Если СтруктураВарианта.Свойство("Ссылка", Ссылка) И Не Ссылка.Пустая() Тогда
		Вариант = СтруктураВарианта.Ссылка.ПолучитьОбъект();
	Иначе
		Вариант = Справочники.ВариантыОтчетов.СоздатьЭлемент();
	КонецЕсли; 
	
	МассивКлюча = СтрРазделить(СтруктураВарианта.Ключ, "/");
	Родитель = Справочники.ВариантыОтчетов.ПустаяСсылка();
	
	Если МассивКлюча.Количество() = 2 Тогда
		Попытка
			Родитель = Справочники.ВариантыОтчетов.ПолучитьСсылку(Новый УникальныйИдентификатор(МассивКлюча[1]));
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
	Вариант.Родитель = Родитель;
	ЗаполнитьЗначенияСвойств(Вариант, СтруктураВарианта);
	
	Вариант.Записать();
	
	Возврат Вариант.Ссылка.УникальныйИдентификатор();

КонецФункции

&НаКлиенте
Функция СформироватьСвободноеНаименование(ТекНаименование)
	
	ШаблонИмениВарианта = СокрЛП(ТекНаименование) +" - копия";
	
	СвободноеНаименование = ШаблонИмениВарианта;
	Найденные = Список.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
	Если Найденные.Количество() = 0 Тогда
		Возврат СвободноеНаименование;
	КонецЕсли;
	
	НомерВарианта = 1;
	Пока Истина Цикл
		НомерВарианта = НомерВарианта + 1;
		СвободноеНаименование = ШаблонИмениВарианта +" (" + Формат(НомерВарианта, "") + ")";
		Найденные = Список.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
		Если Найденные.Количество() = 0 Тогда
			Возврат СвободноеНаименование;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписок()
	
	ЭтаФорма.Список.Загрузить(Справочники.ВариантыОтчетов.ПолучитьТаблицуВариантовОтчета(ЭтаФорма.Ключ, ЭтаФорма.Организация, ЭтаФорма.Автор));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаления(Ссылка)

	Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Не Ссылка.ПометкаУдаления);

КонецПроцедуры

#КонецОбласти
